In [30]:
from pandas import DataFrame
import json

In [31]:
raw_data = """
        {
         "city": ["Tripoli", "Tripoli", "Rome", "Rome", "Sydney", "Sydney"],
         "rank": ["1st", "2nd", "1st", "2nd", "1st", "2nd"], 
         "name": ["Noureddin", "Adam", "Kevin", "Raihana", "Raghad", "Mahdi"], 
         "score1": [44, 48, 39, 41, 38, 44],
         "score2": [67, 63, 55, 70, 64, 77]
        }
        """

In [32]:
data = json.loads(raw_data)

In [36]:
data['score2'][3]

70

In [37]:
json.dumps(data)

'{"city": ["Tripoli", "Tripoli", "Rome", "Rome", "Sydney", "Sydney"], "name": ["Noureddin", "Adam", "Kevin", "Raihana", "Raghad", "Mahdi"], "score1": [44, 48, 39, 41, 38, 44], "score2": [67, 63, 55, 70, 64, 77], "rank": ["1st", "2nd", "1st", "2nd", "1st", "2nd"]}'

In [38]:
df = DataFrame(data)

In [39]:
df

      city       name rank  score1  score2
0  Tripoli  Noureddin  1st      44      67
1  Tripoli       Adam  2nd      48      63
2     Rome      Kevin  1st      39      55
3     Rome    Raihana  2nd      41      70
4   Sydney     Raghad  1st      38      64
5   Sydney      Mahdi  2nd      44      77